.onAttach <- function(libname, pkgname){
  packageStartupMessage(
    "
                                               ░██               ░██
                                               ░██
 ░████████  ░████████ ░████████   ░███████  ░████████ ░██    ░██ ░██ ░███████  ░██    ░██    ░██
░██    ░██ ░██    ░██ ░██    ░██ ░██    ░██    ░██    ░██    ░██ ░██░██    ░██ ░██    ░██    ░██
░██    ░██ ░██    ░██ ░██    ░██ ░█████████    ░██     ░██  ░██  ░██░█████████  ░██  ░████  ░██
░██   ░███ ░██   ░███ ░██    ░██ ░██           ░██      ░██░██   ░██░██          ░██░██ ░██░██
 ░█████░██  ░█████░██ ░██    ░██  ░███████      ░████    ░███    ░██ ░███████     ░███   ░███
       ░██        ░██
 ░███████   ░███████


  ggNetView v0.13.1 (2025)
  Developed by Jiawang's Network Visualization Group

  Maintainers:
   - Yue Liu <yueliu@iae.ac.cn>
   - Chao Wang <cwang@iae.ac.cn>

  GitHub: https://github.com/Jiawang1209/ggNetView
  Bug Reports: https://github.com/Jiawang1209/ggNetView/issues

  Type citation('ggNetView') for how to cite this package.
  Run browseVignettes('ggNetView') for documentation.
                        "
  )
}
